micropython/micropython/ports/raspberrypi/boards/pimoroni_motor2040/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "Pimoroni Motor 2040"
#define MICROPY_HW_MCU_NAME "rp2040"

#define MICROPY_HW_NEOPIXEL         (&pin_GPIO18)
#define MICROPY_HW_NEOPIXEL_COUNT   (1)

#define DEFAULT_UART_BUS_TX (&pin_GPIO16)
#define DEFAULT_UART_BUS_RX (&pin_GPIO17)

#define DEFAULT_I2C_BUS_SCL (&pin_GPIO21)
#define DEFAULT_I2C_BUS_SDA (&pin_GPIO20)
